## Pandas_Read_Write

- Read: pd.read_{포맷명}("파일명")
- 저장할때 : df.to_{포맷명}("파일명")

1. csv 읽기 read_csv

- header 주의 ! spark랑 다름
- spark :`header=True` 무조건 첫 줄이 header
- pandas : `header=0` 0번째 줄이 header, 없는 파일은 None, False가 아님!

2. 엑셀 읽기 read_excel
- openyxl 라이브러리가 설치해야한다

3. Parquet : pyarrow 라이브러리 필요

4. json : 웹 데이터나 로그 파일 읽을때 필요

- lines=True : 로그파일처럼 한줄에 Json하나씩 들어있는 경우 필수

In [4]:
import pandas as pd

In [11]:
df=pd.read_csv(
    "file:///workspace/data/data.csv",
    sep=",",
    header=0,
    encoding="utf-8"
)
df.head()

   id     name  age  score     city
0   1    Alice   23     88    Seoul
1   2      Bob   30     92    Busan
2   3  Charlie   25     76  Incheon
3   4    David   28     85    Daegu
4   5      Eva   22     90    Seoul

In [12]:
# header=1 이면, 0번째 줄은 무시하고, 1번째 줄부터 header

In [9]:
df=pd.read_csv(
    "file:///workspace/data/header_row_1.csv",
    sep=",",
    header=0,
    encoding="utf-8"
)
df.head()

       ---- (0번 줄) 2024년 1분기 보고서 ----
이름  나이                             부서
김철수 30                            영업팀
이영희 27                           마케팅팀
박민수 35                            개발팀
최지은 29                            인사팀

In [10]:
df=pd.read_csv(
    "file:///workspace/data/header_row_1.csv",
    sep=",",
    header=1,
    encoding="utf-8"
)
df.head()

    이름  나이    부서
0  김철수  30   영업팀
1  이영희  27  마케팅팀
2  박민수  35   개발팀
3  최지은  29   인사팀

In [2]:
# read_excel

In [5]:
df = pd.read_excel("file:///workspace/data/data.xlsx", sheet_name="Sheet1")
df.head()

   id     name  age  score     city
0   1    Alice   23     88    Seoul
1   2      Bob   30     92    Busan
2   3  Charlie   25     76  Incheon
3   4    David   28     85    Daegu
4   5      Eva   22     90    Seoul

In [6]:
xls = pd.ExcelFile("file:///workspace/data/data.xlsx")
print(xls.sheet_names)

['Sheet1']

In [12]:
# Parquet 파일 저장하고 읽기

In [13]:
df = pd.DataFrame({
"id": [1, 2, 3, 4, 5],
"name": ["Alice", "Bob", "Charlie", "David", "Eva"],
"age": [23, 30, 25, 28, 22],
"score": [88.5, 92.0, 76.5, 85.0, 90.0],
"city": ["Seoul", "Busan", "Incheon", "Daegu", "Seoul"]
})


df.to_parquet("file:///workspace/data/data.parquet")

In [14]:
df=pd.read_parquet("file:///workspace/data/data.parquet")
df

   id     name  age  score     city
0   1    Alice   23   88.5    Seoul
1   2      Bob   30   92.0    Busan
2   3  Charlie   25   76.5  Incheon
3   4    David   28   85.0    Daegu
4   5      Eva   22   90.0    Seoul

In [15]:
# json

In [18]:
df=pd.read_json("file:///workspace/data/data.json")
df

   order_id  user   product    price  quantity  order_date
0      1001   kim  notebook  1200000         1  2024-01-05
1      1002   lee     mouse    25000         2  2024-01-07
2      1003  park  keyboard    85000         1  2024-01-10

In [22]:
# 한줄에 하나씩 있는 로그형 에러 
# df=pd.read_json("file:///workspace/data/log.json")
# df

In [24]:
df=pd.read_json("file:///workspace/data/log.json",lines=True)
df

            timestamp  user  action   status     page
0 2024-01-01 09:00:00   kim   login  success      NaN
1 2024-01-01 09:05:12   kim    view      NaN  product
2 2024-01-01 09:07:45   lee   login     fail      NaN
3 2024-01-01 09:10:03  park   login  success      NaN
4 2024-01-01 09:12:30   kim  logout  success      NaN